GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307z(g-e-c)xx-pinctrl.h
/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, CTC_NORMP)
#define CTC_SYNC_PD15_NORMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, CTC_NORMP)
#define CTC_SYNC_PD15_PRMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, CTC_PRMP)
#define CTC_SYNC_PF0_NORMP \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, CTC_NORMP)
#define CTC_SYNC_PF0_FRMP \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, CTC_FRMP)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ENET_MDC */
#define ENET_MDC_PC1 \
	GD32_PINMUX_AFIO('C', 1, ALTERNATE, NORMP)

/* ENET_MDIO */
#define ENET_MDIO_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* ENET_MII_COL */
#define ENET_MII_COL_PA3 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* ENET_MII_CRS */
#define ENET_MII_CRS_PA0 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* ENET_MII_PPS_OUT */
#define ENET_MII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ENET_MII_RXD0 */
#define ENET_MII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD0_PD9_NORMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD0_PD9_RMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, ENET_RMP)

/* ENET_MII_RXD1 */
#define ENET_MII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD1_PD10_NORMP \
	GD32_PINMUX_AFIO('D', 10, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD1_PD10_RMP \
	GD32_PINMUX_AFIO('D', 10, GPIO_IN, ENET_RMP)

/* ENET_MII_RXD2 */
#define ENET_MII_RXD2_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD2_PD11_NORMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD2_PD11_RMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, ENET_RMP)

/* ENET_MII_RXD3 */
#define ENET_MII_RXD3_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD3_PD12_NORMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, ENET_NORMP)
#define ENET_MII_RXD3_PD12_RMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, ENET_RMP)

/* ENET_MII_RX_CLK */
#define ENET_MII_RX_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)

/* ENET_MII_RX_DV */
#define ENET_MII_RX_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, ENET_NORMP)
#define ENET_MII_RX_DV_PD8_NORMP \
	GD32_PINMUX_AFIO('D', 8, GPIO_IN, ENET_NORMP)
#define ENET_MII_RX_DV_PD8_RMP \
	GD32_PINMUX_AFIO('D', 8, GPIO_IN, ENET_RMP)

/* ENET_MII_RX_ER */
#define ENET_MII_RX_ER_PB10 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)

/* ENET_MII_TXD0 */
#define ENET_MII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ENET_MII_TXD1 */
#define ENET_MII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ENET_MII_TXD2 */
#define ENET_MII_TXD2_PC2 \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* ENET_MII_TXD3 */
#define ENET_MII_TXD3_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)

/* ENET_MII_TX_CLK */
#define ENET_MII_TX_CLK_PC3 \
	GD32_PINMUX_AFIO('C', 3, ALTERNATE, NORMP)

/* ENET_MII_TX_EN */
#define ENET_MII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* ENET_RMII_CRS_DV */
#define ENET_RMII_CRS_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, ENET_NORMP)
#define ENET_RMII_CRS_DV_PD8_NORMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, ENET_NORMP)
#define ENET_RMII_CRS_DV_PD8_RMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, ENET_RMP)

/* ENET_RMII_PPS_OUT */
#define ENET_RMII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ENET_RMII_REF_CLK */
#define ENET_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* ENET_RMII_RXD0 */
#define ENET_RMII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ENET_NORMP)
#define ENET_RMII_RXD0_PD9_NORMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, ENET_NORMP)
#define ENET_RMII_RXD0_PD9_RMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, ENET_RMP)

/* ENET_RMII_RXD1 */
#define ENET_RMII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ENET_NORMP)
#define ENET_RMII_RXD1_PD10_NORMP \
	GD32_PINMUX_AFIO('D', 10, GPIO_IN, ENET_NORMP)
#define ENET_RMII_RXD1_PD10_RMP \
	GD32_PINMUX_AFIO('D', 10, GPIO_IN, ENET_RMP)

/* ENET_RMII_TXD0 */
#define ENET_RMII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ENET_RMII_TXD1 */
#define ENET_RMII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ENET_RMII_TX_EN */
#define ENET_RMII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* EXMC_A0 */
#define EXMC_A0_PF0 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, NORMP)

/* EXMC_A1 */
#define EXMC_A1_PF1 \
	GD32_PINMUX_AFIO('F', 1, ALTERNATE, NORMP)

/* EXMC_A10 */
#define EXMC_A10_PG0 \
	GD32_PINMUX_AFIO('G', 0, ALTERNATE, NORMP)

/* EXMC_A11 */
#define EXMC_A11_PG1 \
	GD32_PINMUX_AFIO('G', 1, ALTERNATE, NORMP)

/* EXMC_A12 */
#define EXMC_A12_PG2 \
	GD32_PINMUX_AFIO('G', 2, ALTERNATE, NORMP)

/* EXMC_A13 */
#define EXMC_A13_PG3 \
	GD32_PINMUX_AFIO('G', 3, ALTERNATE, NORMP)

/* EXMC_A14 */
#define EXMC_A14_PG4 \
	GD32_PINMUX_AFIO('G', 4, ALTERNATE, NORMP)

/* EXMC_A15 */
#define EXMC_A15_PG5 \
	GD32_PINMUX_AFIO('G', 5, ALTERNATE, NORMP)

/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AFIO('D', 11, ALTERNATE, NORMP)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, NORMP)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, NORMP)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AFIO('E', 3, ALTERNATE, NORMP)

/* EXMC_A2 */
#define EXMC_A2_PF2 \
	GD32_PINMUX_AFIO('F', 2, ALTERNATE, NORMP)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AFIO('E', 4, ALTERNATE, NORMP)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, NORMP)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, NORMP)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AFIO('E', 2, ALTERNATE, NORMP)

/* EXMC_A24 */
#define EXMC_A24_PG13 \
	GD32_PINMUX_AFIO('G', 13, ALTERNATE, NORMP)

/* EXMC_A25 */
#define EXMC_A25_PG14 \
	GD32_PINMUX_AFIO('G', 14, ALTERNATE, NORMP)

/* EXMC_A3 */
#define EXMC_A3_PF3 \
	GD32_PINMUX_AFIO('F', 3, ALTERNATE, NORMP)

/* EXMC_A4 */
#define EXMC_A4_PF4 \
	GD32_PINMUX_AFIO('F', 4, ALTERNATE, NORMP)

/* EXMC_A5 */
#define EXMC_A5_PF5 \
	GD32_PINMUX_AFIO('F', 5, ALTERNATE, NORMP)

/* EXMC_A6 */
#define EXMC_A6_PF12 \
	GD32_PINMUX_AFIO('F', 12, ALTERNATE, NORMP)

